# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "gentleman-programming/tap/engram"

# Formulas (Command Line Tools)
brew "zsh"
brew "atuin"
brew "zoxide"
brew "fnm"
brew "bun"
brew "gh"
brew "pyenv"
brew "rclone"
brew "git-lfs"
brew "git-delta"

# Casks (GUI Applications)
cask "warp"
cask "google-chrome"
cask "1password"
cask "1password-cli"
cask "bruno"
cask "raycast"
cask "wakatime"
cask "ollama"
cask "visual-studio-code"
cask "rectangle"
cask "discord"
cask "spotify"
