# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "gentleman-programming/tap/engram"

# Formulas
brew "zsh"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "atuin"
brew "zoxide"
brew "fzf"
brew "eza"
brew "dust"
brew "btop"
brew "ripgrep"
brew "fd"
brew "bat"
brew "tldr"
brew "fnm"
brew "bun"
brew "gh"
brew "gemini-cli"
brew "pyenv"
brew "rclone"
brew "tree"
brew "lazygit"
brew "lazydocker"
brew "git-lfs"
brew "git-delta"

# Casks
cask "warp"
cask "google-chrome"
cask "1password"
cask "1password-cli"
cask "bruno"
cask "raycast"
cask "wakatime"
cask "visual-studio-code"
cask "rectangle"
cask "discord"
cask "spotify"
